data_generation/Case6/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
256062
(
-3.73147e-13
3.79418e-05
-5.00373e-12
4.1736e-05
-1.0078e-11
4.59096e-05
-1.5621e-11
5.05006e-05
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
76
(
-3.79418e-05
-4.1736e-05
-4.59096e-05
-5.05006e-05
-5.55506e-05
-6.11057e-05
-6.72163e-05
-7.39379e-05
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
156
(
7.49465e-05
7.64454e-05
7.79743e-05
7.95338e-05
8.11245e-05
8.27469e-05
8.44019e-05
8.60899e-05
...
)
;
    }
    lowerWallStartup
    {
        type            symmetryPlane;
        value           uniform 0;
    }
    upperWallStartup
    {
        type            symmetryPlane;
        value           uniform 0;
    }
    upperWall
    {
        type            calculated;
        value           uniform 0;
    }
    lowerWall
    {
        type            calculated;
        value           uniform 0;
    }
    back
    {
        type            empty;
        value           nonuniform 0();
    }
    front
    {
        type            empty;
        value           nonuniform 0();
    }
}


// ************************************************************************* //
