data_generation/Case6/constant/cx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "constant";
    object      cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
128808
(
-1.64973
-1.64973
-1.64973
-1.64973
-1.64973
-1.64973
-1.64973
-1.64973
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
76
(
-1.651
-1.651
-1.651
-1.651
-1.651
-1.651
-1.651
-1.651
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
156
(
0.635
0.635
0.635
0.635
0.635
0.635
0.635
0.635
...
)
;
    }
    lowerWallStartup
    {
        type            symmetryPlane;
    }
    upperWallStartup
    {
        type            symmetryPlane;
    }
    upperWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
1298
(
0.00040625
0.00121875
0.00203125
0.00284375
0.00365625
0.00446875
0.00528125
0.00609375
...
)
;
    }
    lowerWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
1378
(
-0.000317644
-0.000953366
-0.00158996
-0.00222742
-0.00286575
-0.00350495
-0.00414503
-0.00478598
...
)
;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
}


// ************************************************************************* //
