data_generation/Case6/constant/cy
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "constant";
    object      cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
128808
(
0.0159426
0.0160845
0.0162407
0.0164124
0.0166013
0.0168092
0.0170378
0.0172892
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
76
(
0.0159426
0.0160845
0.0162407
0.0164124
0.0166013
0.0168092
0.0170378
0.0172892
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
156
(
0.114145
0.113832
0.113512
0.113186
0.112854
0.112515
0.112169
0.111817
...
)
;
    }
    lowerWallStartup
    {
        type            symmetryPlane;
    }
    upperWallStartup
    {
        type            symmetryPlane;
    }
    upperWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
1298
(
0.1143
0.1143
0.1143
0.1143
0.1143
0.1143
0.1143
0.1143
...
)
;
    }
    lowerWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
1378
(
0.015875
0.015875
0.015875
0.015875
0.015875
0.015875
0.015875
0.015875
...
)
;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
}


// ************************************************************************* //
