data_generation/Case6/system/stressComponents
type            turbulenceFields;
libs            ("libfieldFunctionObjects.so");
writeControl    writeTime;
fields         (R devReff nuEff);
